In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### dict ↔ DataFrame

In [2]:
# 샘플 dict 생성
dict1 = {'Name': ['Choi', 'Hong', 'Kim'],
          'Korean': [60, 50, 75],
          'Math': [70, 85, 95]}

print(type(dict1))
dict1

<class 'dict'>

{'Name': ['Choi', 'Hong', 'Kim'], 'Korean': [60, 50, 75], 'Math': [70, 85, 95]}

In [3]:
# dict → DataFrame
df1 = pd.DataFrame(dict1)
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

   Name  Korean  Math
0  Choi      60    70
1  Hong      50    85
2   Kim      75    95

In [4]:
# DataFrame → dict
dict2 = df1.to_dict()
print(type(dict2))
print(dict2)

<class 'dict'>
{'Name': {0: 'Choi', 1: 'Hong', 2: 'Kim'}, 'Korean': {0: 60, 1: 50, 2: 75}, 'Math': {0: 70, 1: 85, 2: 95}}

### dict ↔ list

In [5]:
# 샘플 dict 생성
dict1 = {'a' : 123, 'b' : 456, 'c' : 789}
print(type(dict1))
dict1

<class 'dict'>

{'a': 123, 'b': 456, 'c': 789}

In [6]:
# dict → list
list1 = list(dict1.keys())
list2 = list(dict1.values())
print(type(list2))
list2

<class 'list'>

[123, 456, 789]

In [7]:
# list → dict
dict2 = dict(zip(list1, list2))
print(type(dict2))
dict2

<class 'dict'>

{'a': 123, 'b': 456, 'c': 789}

### DataFrame ↔ Series

In [8]:
# 샘플 DataFrame 생성
df1 = sns.load_dataset('tips').sample(5)
df1

     total_bill   tip     sex smoker   day    time  size
95        40.17  4.73    Male    Yes   Fri  Dinner     4
155       29.85  5.14  Female     No   Sun  Dinner     5
207       38.73  3.00    Male    Yes   Sat  Dinner     4
4         24.59  3.61  Female     No   Sun  Dinner     4
83        32.68  5.00    Male    Yes  Thur   Lunch     2

In [9]:
# DataFrame → Series : 열이 하나인 경우 자동으로 변환
sr1 = df1['total_bill']
print(type(sr1))
sr1.head()

<class 'pandas.core.series.Series'>

95     40.17
155    29.85
207    38.73
4      24.59
83     32.68
Name: total_bill, dtype: float64

In [10]:
# Series → DataFrame
print(type(sr1.to_frame()))
sr1.to_frame()

<class 'pandas.core.frame.DataFrame'>

     total_bill
95        40.17
155       29.85
207       38.73
4         24.59
83        32.68

In [11]:
# Series → DataFrame : 열이 복수인 경우 자동으로 변환
sr2 = df1['tip']
df2 = pd.concat([sr1, sr2], axis=1)
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

     total_bill   tip
95        40.17  4.73
155       29.85  5.14
207       38.73  3.00
4         24.59  3.61
83        32.68  5.00

### Series ↔ list

In [12]:
# Series → list
list1 = sr1.to_list()
print(type(list1))
list1

<class 'list'>

[40.17, 29.85, 38.73, 24.59, 32.68]

In [13]:
# list → Series 
sr3 = pd.Series(list1)
print(type(sr3))
sr3

<class 'pandas.core.series.Series'>

0    40.17
1    29.85
2    38.73
3    24.59
4    32.68
dtype: float64

### Series ↔ dict

In [14]:
# Series → dict 변환 : index가 key로 됨
dict1 = sr2.to_dict()
print(type(dict1))
dict1

<class 'dict'>

{95: 4.73, 155: 5.14, 207: 3.0, 4: 3.61, 83: 5.0}

In [15]:
# dict → Series : 마찬가지로 key가 index로 됨
pd.Series(dict1)

95     4.73
155    5.14
207    3.00
4      3.61
83     5.00
dtype: float64

### list ↔ tuple

In [16]:
# list → tuple
tuple1 = tuple(list1)
print(type(tuple1))
tuple1

<class 'tuple'>

(40.17, 29.85, 38.73, 24.59, 32.68)

In [17]:
# tuple → list
list2 = list(tuple1)
print(type(list2))
list2

<class 'list'>

[40.17, 29.85, 38.73, 24.59, 32.68]

### range → list

In [18]:
# 샘플 range
print(type(range(10)))
range(10)

<class 'range'>

range(0, 10)

In [19]:
# range → list
list1 = [*range(10)]
print(type(list1))
list1

<class 'list'>

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

### ndarry → DataFrame

In [20]:
# 샘플 넘파이 array 생성
n1 = np.array([[1, 2, 3], [4, 5, 6]])
print(type(n1))
n1

<class 'numpy.ndarray'>

array([[1, 2, 3],
       [4, 5, 6]])

In [21]:
# ndarry → DataFrame
df1 = pd.DataFrame.from_records(n1, index=['a', 'b'], columns = [1, 3, 5])
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

   1  3  5
a  1  2  3
b  4  5  6

In [ ]:
# numpy랑 set도 추후 추가